Revit 2026 API

# ElectricalSystemGroundConductorsNumber Property

---

The GroundConductors Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GroundConductorsNumber { get; }
```
```vb
Public ReadOnly Property GroundConductorsNumber As Integer
	Get
```
```cpp
public:
property int GroundConductorsNumber {
	int get ();
}
```
```fsharp
member GroundConductorsNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the GroundConductors Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace